In [1]:
import pandas as pd
import numpy as np

In [2]:
people=pd.DataFrame(np.random.randn(5,5),
                   columns=['a','b','c','d','e'],
                   index=['Joe','Steve','Wes','Jim','Travis'])

In [3]:
people

               a         b         c         d         e
Joe     1.071542  0.313575  0.028699  0.666899  1.395071
Steve   1.855914  1.020085 -0.586948  0.326611  1.034443
Wes    -0.027093  0.414082  0.275726 -0.233468  0.382496
Jim    -0.162298 -0.129690 -1.123291 -1.264154 -0.032624
Travis  0.953816 -1.025002  0.460119 -0.309329 -0.751464

In [14]:
#2:3为行，【1，2】为列
#又测试了people.iloc[2:-1,[1,2]] = np.nan
people.iloc[2:3,[1,2]] = np.nan

In [15]:
people

               a         b         c         d         e
Joe     1.071542  0.313575  0.028699  0.666899  1.395071
Steve   1.855914  1.020085 -0.586948  0.326611  1.034443
Wes    -0.027093       NaN       NaN -0.233468  0.382496
Jim    -0.162298       NaN       NaN -1.264154 -0.032624
Travis  0.953816 -1.025002  0.460119 -0.309329 -0.751464

In [16]:
mapping={'a':'red', 'b':'red', 'c':'blue',
        'd':'blue', 'e':'red', 'f':'orange'}

In [17]:
by_column=people.groupby(mapping, axis=1)

In [18]:
by_column.sum()

            blue       red
Joe     0.695598  2.780189
Steve  -0.260337  3.910442
Wes    -0.233468  0.355402
Jim    -1.264154 -0.194922
Travis  0.150790 -0.822651

In [22]:
by_column.count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        1    2
Travis     2    3

In [19]:
map_series=pd.Series(mapping)

In [20]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [21]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        1    2
Travis     2    3